# 1 задание

#t = input ("Введите первое число: ")
#a = int(t)

#t = input ("Введите второе число: ")
#b = int(t)

#t = input ("Введите третье число: ")
#c = int(t)

#x=(a*100+b*10+c)
#print(x)

#2 Задание

#num_1 = int(input("Введите первое число: "))

#num_2 = int(input("Введите второе число: "))

#num_3 = int(input("Введите третье число: "))

#num_4 = int(input("Введите четвёртое число: "))

#result = num_1 * num_2 * num_3 * num_4
#print("Произведение чисел:", result)

#3 задание

#if __name__ == '__main__':
#    try:
#        meters = float(input('Введите в метрах: '))
#    except:
#        print('Ошибка ввода числа')
#        exit()
#    cvt_to = int(input('Во что переводить? 1 - мм, 2 - см, 3 - дециметры, 4 - мили : ' ))
#    if (cvt_to == 1):
#        print('В миллиметрах:', meters * 1000)
#    elif (cvt_to == 2):
#        print('В сантиметрах:', meters * 100)
#    elif (cvt_to == 3):
#        print('В дециметрах:', meters * 10)
#    elif (cvt_to == 4):
#        print('В милях:', meters * 0.000621371)
#    else:
#        print('Выбран неверный вариант')



#4 задание

#a = int(input("Введите размер основания треугольника: "))
#b = int(input("Введите размер высоты треугольника: "))

#result = (1/2)*a*b;
#print("Площадь данного треугольника:", result)



#5 Задание


number = input("Введите число");
number = number[::-1]
print(number)

